In [5]:
import pandas as pd
import statsmodels.stats.anova as anova
from statsmodels.formula.api import ols

In [8]:
year_return=pd.read_csv(r'C:\Users\dell\Desktop\Python Quant Book\Python Quant Book\part 2\016\TRD_Year.csv',encoding='gbk')
year_return.head()

   Code  Year    Return Industry
0     1  2014  0.572980   货币金融服务
1     2  2014  0.827567     房地产业
2     4  2014  0.336481    医药制造业
3     5  2014  0.640000     房地产业
4     6  2014  0.477997     房地产业

In [10]:
model=ols('Return ~ C(Industry)',data=year_return.dropna()).fit()

In [11]:
table1=anova.anova_lm(model)

In [12]:
print(table1)

                 df      sum_sq   mean_sq         F        PR(>F)
C(Industry)    74.0   60.517228  0.817800  4.177614  4.382045e-28
Residual     2302.0  450.634318  0.195758       NaN           NaN

In [13]:
#加载数据
PSID=pd.read_csv(r'C:\Users\dell\Desktop\Python Quant Book\Python Quant Book\part 2\016\PSID.csv')

In [14]:
PSID.head()

   Unnamed: 0  intnum  persnum  age  educatn  earnings  hours  kids   married
0           1       4        4   39     12.0     77250   2940     2   married
1           2       4        6   35     12.0     12000   2040     2  divorced
2           3       4        7   33     12.0      8000    693     1   married
3           4       4      173   39     10.0     15000   1904     2   married
4           5       5        2   47      9.0      6500   1683     5   married

In [17]:
#建立模型
model=ols('earnings ~C(married)+C(educatn)',data=PSID.dropna()).fit()

In [18]:
table2=anova.anova_lm(model)

In [19]:
print(table2)

                df        sum_sq       mean_sq          F         PR(>F)
C(married)     6.0  1.956487e+10  3.260811e+09  15.551238   9.355695e-18
C(educatn)    19.0  2.082990e+11  1.096311e+10  52.284500  9.947527e-180
Residual    4829.0  1.012553e+12  2.096818e+08        NaN            NaN

In [20]:
model=ols('earnings ~C(married)*C(educatn)',data=PSID.dropna()).fit()

In [24]:
table3=anova.anova_lm(model)

In [25]:
print(table3)

                           df        sum_sq       mean_sq          F         PR(>F)
C(married)                6.0  1.956487e+10  3.260811e+09  15.477314   1.160545e-17
C(educatn)               19.0  2.082990e+11  1.096311e+10  52.035962  1.334463e-178
C(married):C(educatn)   114.0  2.444095e+10  2.143943e+08   1.017614   4.312622e-01
Residual               4745.0  9.996921e+11  2.106833e+08        NaN            NaN